app/views/bets/_form.html.erb

    <%= f.label :match_id %>
    <%= f.select :match_id, Match.all.collect {|match| [match.id]}, {include_blank: true}, {required: true} %>
---
SELECT "matches".* FROM "matches"

    <%= f.label :user_id %>
    <%= f.select :user_id, User.all.collect {|user| [user.id]}, {include_blank: true}, {required: true} %>
---
SELECT "users".* FROM "users"

    <%= f.label :team_id %>
    <%= f.select :team_id, Team.all.collect {|team| [team.id]}, {include_blank: true}, {required: true} %>
---
SELECT "teams".* FROM "teams"