app/views/events/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %>
    <%= f.select :user_id, User.all.collect {|user| [user.id]}, {include_blank: true}, {required: true} %>