app/views/matches/_form.html.erb

    <%= f.label :event_id %>
    <%= f.select :event_id, Event.all.collect {|event| [event.id]}, {include_blank: true}, {required: true} %>
---
SELECT "events".* FROM "events"