app/controllers/bets_controller.rb

SELECT "bets".* FROM "bets"
---
  def index
    @bets = Bet.all

INSERT INTO "bets" ("ammount", "bet_state", "created_at", "updated_at", "match_id", "user_id", "team_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["ammount", 1], ["bet_state", 0], ["created_at", 2017-05-05 17:43:25 UTC], ["updated_at", 2017-05-05 17:43:25 UTC], ["match_id", 1], ["user_id", 2], ["team_id", 1]]
---
  def create
    @bet = Bet.new(bet_params)
    withdraw_coins
    respond_to do |format|
      if @bet.save

SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bet
      @bet = Bet.find(params[:id])