app/controllers/events_controller.rb

INSERT INTO "events" ("event_type", "private", "date_start", "date_end", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "date_end" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["date_end", Sat, 06 May 2017], ["updated_at", 2017-05-05 17:59:31 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)