app/controllers/matches_controller.rb

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @event = Event.find(params[:event_id])
    @match = Match.find(params[:id])

INSERT INTO "matches" ("match_date", "bet_date", "name", "state", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["match_date", Sat, 29 Apr 2017], ["bet_date", Sat, 29 Apr 2017], ["name", "final"], ["state", 0], ["created_at", 2017-04-29 21:05:35 UTC], ["updated_at", 2017-04-29 21:05:35 UTC], ["event_id", 2]]
---
  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save

UPDATE "matches" SET "match_date" = $1, "bet_date" = $2, "updated_at" = $3 WHERE "matches"."id" = $4  [["match_date", Thu, 11 May 2017], ["bet_date", Thu, 11 May 2017], ["updated_at", 2017-05-09 13:05:43 UTC], ["id", 3]]
---
  def update
    @match = Match.edit(match_params)

    respond_to do |format|
      if @match.update(match_params)