app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Catolica"], ["description", "Segundo"], ["created_at", 2017-04-29 22:36:55 UTC], ["updated_at", 2017-04-29 22:36:55 UTC]]
---
  def create
    @team = Team.new(team_params)
    respond_to do |format|
      if @team.save