app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search]).paginate(:page => params[:page], :per_page => 10)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", ""], ["first_name", ""], ["last_name", ""], ["password", ""], ["created_at", 2017-04-29 18:15:45 UTC], ["updated_at", 2017-04-29 18:15:45 UTC]]